---
kind: property
id: P:Autodesk.Revit.DB.FamilyPointLocation.Name
source: html/51cffd8c-3cc7-4b16-854f-a628cdaf83e9.htm
---
# Autodesk.Revit.DB.FamilyPointLocation.Name Property

The name of the corresponding reference point in the Family document.

## Syntax (C#)
```csharp
public string Name { get; }
```